#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция СтатусДокумента(Объект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Перечисления.дкл_СтатусыДокументов.ПустаяСсылка();

	Если НЕ ЗначениеЗаполнено(Объект) Тогда
		Возврат Результат;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	дкл_СтатусыДокументов.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.дкл_СтатусыДокументов КАК дкл_СтатусыДокументов
		|ГДЕ
		|	дкл_СтатусыДокументов.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Результат = ВыборкаДетальныеЗаписи.Статус;	
	КонецЕсли;                                    
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция СтатусИДатаСтатусаДокумента(Объект) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый Структура("Статус, Дата", 
		Перечисления.дкл_СтатусыДокументов.ПустаяСсылка(), Дата(1,1,1));

	Если НЕ ЗначениеЗаполнено(Объект) Тогда
		Возврат Результат;	
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	дкл_СтатусыДокументов.Статус КАК Статус,
		|	дкл_СтатусыДокументов.Дата КАК Дата
		|ИЗ
		|	РегистрСведений.дкл_СтатусыДокументов КАК дкл_СтатусыДокументов
		|ГДЕ
		|	дкл_СтатусыДокументов.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, ВыборкаДетальныеЗаписи);	
	КонецЕсли;                                    
	
	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат Результат;
	
КонецФункции

#КонецЕсли
