
&После("ПередЗаписью")
Процедура дкл_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	// https://jira.dikomdev.ru/browse/ERPDEV-3531
	// Если статус Склад 15 != "Новый", то нельзя изменять, удалять и распроводить документ Отбора, 
	// если у пользователя нету полных прав.
	
	//Если ПолучитьФункциональнуюОпцию("дкл_ИспользуетсяТСДСклад15ДляОтборов") И НЕ РольДоступна("ПолныеПрава") Тогда
	//	
	//	дкл_Статус = РегистрыСведений.дкл_СтатусыДокументов.СтатусДокумента(Ссылка);
	//	Если ЗначениеЗаполнено(дкл_Статус) И НЕ дкл_Статус = Перечисления.дкл_СтатусыДокументов.Новый Тогда
	//		ОбщегоНазначения.СообщитьПользователю(
	//			"Изменение документа возможно только в статусе Склад 15 = ""Новый""", , , ,Отказ);			
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
КонецПроцедуры

