#Область ПрограммныйИнтерфейс 

// Выполняет запись сообщения об ошибке в журнал регистраци
//
// Параметры:
//  Сообщение - Строка - сообщение об ошибке
//
Процедура СообщитьОбОшибке(Сообщение) Экспорт
	ЗаписьЖурналаРегистрации("ДиКом АСХ", УровеньЖурналаРегистрации.Ошибка, , , Сообщение);
КонецПроцедуры

// Выполняет запись информационного сообщения в журнал регистраци
//
// Параметры:
//  Сообщение - Строка - информационное сообщение
//
Процедура СообщитьИнформацию(Сообщение) Экспорт
	ЗаписьЖурналаРегистрации("ДиКом АСХ", УровеньЖурналаРегистрации.Информация, , , Сообщение);
КонецПроцедуры

#КонецОбласти
