#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если НЕ Активность Тогда
		ПроверяемыеРеквизиты.Очистить();	
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления И ЗначениеЗаполнено(Ссылка) Тогда
		
		НЗ = РегистрыСведений.дкл_Полки.СоздатьНаборЗаписей();
		НЗ.Отбор.НастройкаСклада.Установить(Ссылка);
		НЗ.Записать();

		НЗ = РегистрыСведений.дкл_ПользователиСкладов.СоздатьНаборЗаписей();
		НЗ.Отбор.НастройкаСклада.Установить(Ссылка);
		НЗ.Записать();

		НЗ = РегистрыСведений.дкл_НоменклатураСкладов.СоздатьНаборЗаписей();
		НЗ.Отбор.НастройкаСклада.Установить(Ссылка);
		НЗ.Записать();

		НЗ = РегистрыСведений.дкл_СостояниеПолки.СоздатьНаборЗаписей();
		НЗ.Отбор.НастройкаСклада.Установить(Ссылка);
		НЗ.Записать();

		НЗ = РегистрыСведений.дкл_СтатусыСкладовЛифтов.СоздатьНаборЗаписей();
		НЗ.Отбор.НастройкаСкладаЛифта.Установить(Ссылка);
		НЗ.Записать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	дкл_ОчередьСообщений.IDСообщения КАК IDСообщения
		|ИЗ
		|	РегистрСведений.дкл_ОчередьСообщений КАК дкл_ОчередьСообщений
		|ГДЕ
		|	дкл_ОчередьСообщений.НастройкаСклада = &НастройкаСклада";
		
		Запрос.УстановитьПараметр("НастройкаСклада", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НЗ = РегистрыСведений.дкл_ОчередьСообщений.СоздатьНаборЗаписей();
			НЗ.Отбор.IDСообщения.Установить(ВыборкаДетальныеЗаписи.IDСообщения);
			НЗ.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ВерсияПО = "1.6";
КонецПроцедуры

#КонецОбласти

#КонецЕсли