Функция submitOrder(machineId =  Неопределено, order = Неопределено)                 
	
	Результат = Справочники.дкл_НастройкиСкладовЛифтов.НайтиНастройкуСкладаПоИдентификатору(machineId);
	
	ЗаписьХМЛ  = Новый ЗаписьXML;
	ЗаписьХМЛ.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьХМЛ, order);
	Сообщение = ЗаписьХМЛ.Закрыть();

	ДанныеСообщенияОбмена = дкл_ОбменДаннымиСервер.ИнициализироватьДанныеСообщенияОбмена();
	ДанныеСообщенияОбмена.Обработано = Ложь;
	ДанныеСообщенияОбмена.ТипСообщения = Перечисления.дкл_ТипыСообщений.submitOrder;
	ДанныеСообщенияОбмена.Направление = Перечисления.дкл_НаправлениеСообщения.Входящее;
	ДанныеСообщенияОбмена.НастройкаСклада = Результат.НастройкаСклада;
	ДанныеСообщенияОбмена.Сообщение = Сообщение;
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("РегистрыСведений.дкл_ОчередьСообщений");
	МенеджерОбъекта.ЗаписатьСообщениеВОчередьСообщений(ДанныеСообщенияОбмена);
	
	// выгружать online...                                       
	Результат = МенеджерОбъекта.Выгрузить(ДанныеСообщенияОбмена); 
	
	// обработаем не обработанные по каким-то причинам сообщения (кроме текущего)
	МенеджерОбъекта.ОбработкаОчередиСообщений( ,ДанныеСообщенияОбмена.IDСообщения);
	
	Возврат Истина; // Результат;
	
КонецФункции
