////////////////////////////////////////////////////////////////////////////////
// Общие методы форм, сервер
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// УстановитьВидимостьДоступностьДляПользователя
// 
// Параметры:
//  Форма - Форма - 
Процедура УстановитьВидимостьДоступностьДляПользователя(Форма) Экспорт

	ЕстьПравоУправленияПолками = 
		РегистрыСведений.дкл_ПользователиСкладов.ЕстьПравоУправленияПолками(
			Пользователи.ТекущийПользователь(), Форма.НастройкаСкладаЛифта); 	
			
	ЭтоРабочаяБаза = Справочники.дкл_НастройкиСкладовЛифтов.ПроверитьСтрокуСоединения(Форма.НастройкаСкладаЛифта);		
				
	Элементы = Форма.Элементы;
			
	Если ЕстьПравоУправленияПолками И ЭтоРабочаяБаза Тогда
		Элементы.ФормаВозвратПолки.Видимость = Истина;
		Элементы.ФормаВыдачаПолки.Видимость  = Истина;
		Элементы.ФормаВозвратПолки.Доступность = Истина;
		Элементы.ФормаВыдачаПолки.Доступность  = Истина;
	Иначе
		Элементы.ФормаВозвратПолки.Видимость = Ложь;
		Элементы.ФормаВыдачаПолки.Видимость  = Ложь;
		Элементы.ФормаВозвратПолки.Доступность = Ложь;
		Элементы.ФормаВыдачаПолки.Доступность  = Ложь;
	КонецЕсли;
	
	// https://jira.dikomdev.ru/browse/ERPDEV-3567
	// для карусели отключаем кнопку возврата полки...
	
	Если ЭтоРабочаяБаза Тогда
		
		ВидАСХ = Справочники.дкл_НастройкиСкладовЛифтов.ВидАСХ(Форма.НастройкаСкладаЛифта);
		
		Если ВидАСХ = Перечисления.дкл_ВидыАСХ.Карусель Тогда
			Элементы.ФормаВозвратПолки.Видимость = Ложь;
			Элементы.ФормаВозвратПолки.Доступность = Ложь;
		КонецЕсли;
		
	Иначе
		// Форма.Заголовок = "[КОПИЯ]";		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

