Процедура СравнитьВебСервисы(ИмяWSСсылки, МестоположениеWSDL) Экспорт
	
	  Определение_1 = WSСсылки[ИмяWSСсылки].ПолучитьWSОпределения();
	  Определение_2 = Новый WSОпределения(МестоположениеWSDL); 
	  
	  ЕстьОтличия = Ложь;
	  
	  Сч = 0;
	  Для Каждого Сервис_1 Из Определение_1.Сервисы Цикл
		  Сервис_2 = Определение_2.Сервисы[Сч];
		  СравнитьСервисы(Сервис_1, Сервис_2, ЕстьОтличия);
		  Сч = Сч + 1;
	  КонецЦикла;

	  Если НЕ ЕстьОтличия Тогда
	  	ОбщегоНазначения.СообщитьПользователю("Отличий нет");
	  КонецЕсли;
	  
КонецПроцедуры

Процедура СравнитьСервисы(Сервис_1, Сервис_2, ЕстьОтличия)   
	
	Если НЕ Сервис_1.URIПространстваИмен = Сервис_2.URIПространстваИмен Тогда
		Текст = "Отличаются пространства имен %1 и %2";
		Текст = СтрШаблон(Текст, Сервис_1.URIПространстваИмен, Сервис_2.URIПространстваИмен);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		ЕстьОтличия = Истина;
	КонецЕсли;	
	
	Сч = 0;
	Для Каждого ТочкаПодключения_1 Из Сервис_1.ТочкиПодключения Цикл
		Для Каждого ТочкаПодключения_2 Из Сервис_2.ТочкиПодключения Цикл
			Если ТочкаПодключения_1.Имя = ТочкаПодключения_2.Имя Тогда
				СравнитьТочкиПодключения(ТочкаПодключения_1, ТочкаПодключения_1, ЕстьОтличия);		
			КонецЕсли;
		КонецЦикла;
		Сч = Сч + 1;
	КонецЦикла;
	
КонецПроцедуры

Процедура СравнитьТочкиПодключения(ТочкаПодключения_1, ТочкаПодключения_2, ЕстьОтличия)
	
	Если НЕ ТочкаПодключения_1.Имя = ТочкаПодключения_2.Имя Тогда
		Текст = "Отличаются имена точек подключения %1 и %2";
		Текст = СтрШаблон(Текст, ТочкаПодключения_1.Имя, ТочкаПодключения_2.Имя);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		ЕстьОтличия = Истина;
	КонецЕсли;	

	СравнитьИнтерфейсы(ТочкаПодключения_1.Интерфейс, ТочкаПодключения_2.Интерфейс, ЕстьОтличия);
	
КонецПроцедуры

Процедура СравнитьИнтерфейсы(Интерфейс_1, Интерфейс_2, ЕстьОтличия)
	
	Если НЕ Интерфейс_1.Имя = Интерфейс_2.Имя Тогда
		Текст = "Отличаются имена интерфейсов %1 и %2";
		Текст = СтрШаблон(Текст, Интерфейс_1.Имя, Интерфейс_2.Имя);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		ЕстьОтличия = Истина;
	КонецЕсли;	
	
	Если НЕ Интерфейс_1.URIПространстваИмен = Интерфейс_2.URIПространстваИмен Тогда
		Текст = "Отличаются URIПространстваИмен интерфейсов %1 и %2";
		Текст = СтрШаблон(Текст, Интерфейс_1.URIПространстваИмен, Интерфейс_2.URIПространстваИмен);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		ЕстьОтличия = Истина;
	КонецЕсли;	
	
	Сч = 0;
	Если НЕ Интерфейс_1.Операции.Количество() = Интерфейс_2.Операции.Количество() Тогда
		Текст = "Разное кол-во операций в интерфейсах %1";
		Текст = СтрШаблон(Текст, Интерфейс_1.Имя);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		ЕстьОтличия = Истина;                   
	Иначе
		Для Каждого Операция_1 Из Интерфейс_1.Операции Цикл
			СравнитьОперации(Операция_1, Интерфейс_2.Операции[Сч], ЕстьОтличия);
			Сч = Сч + 1;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура СравнитьОперации(Операция_1, Операция_2, ЕстьОтличия)
	
	Если НЕ Операция_1.Имя = Операция_2.Имя Тогда
		Текст = "Отличаются имена операции  %1 и %2";
		Текст = СтрШаблон(Текст, Операция_1.Имя, Операция_2.Имя);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		ЕстьОтличия = Истина;
	КонецЕсли;	
	
	Сч = 0;                                      
	
	Если НЕ Операция_1.Параметры.Количество() = Операция_2.Параметры.Количество() Тогда
		Текст = "Разное кол-во параметров в операциях %1";
		Текст = СтрШаблон(Текст, Операция_1.Имя);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		ЕстьОтличия = Истина;
	Иначе
		Для Каждого Параметр_1 Из Операция_1.Параметры Цикл
			СравнитьПараметры(Параметр_1, Операция_2.Параметры[Сч], ЕстьОтличия);
			Сч = Сч + 1;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура СравнитьПараметры(Параметр_1, Параметр_2, ЕстьОтличия)
	
	Если НЕ Параметр_1.Имя = Параметр_2.Имя Тогда
		Текст = "Отличаются имена параметров %1 и %2";
		Текст = СтрШаблон(Текст, Параметр_1.Имя, Параметр_2.Имя);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		ЕстьОтличия = Истина;
	КонецЕсли;	
	
	Если НЕ Параметр_1.ВозможноПустой = Параметр_2.ВозможноПустой Тогда
		Текст = "Отличается признак ВозможноПустой у параметров %1 и %2";
		Текст = СтрШаблон(Текст, Параметр_1.Имя, Параметр_2.Имя);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		ЕстьОтличия = Истина;
	КонецЕсли;	
	
	Если ТипЗнч(Параметр_1.Тип) = Тип("ТипОбъектаXDTO") Тогда
		СравнитьТипыXDTO(Параметр_1.Тип, Параметр_2.Тип, ЕстьОтличия);	
	КонецЕсли;
	
КонецПроцедуры

Процедура СравнитьТипыXDTO(Тип_1, Тип_2, ЕстьОтличия)

	Если НЕ Тип_1.Имя = Тип_2.Имя Тогда
		Текст = "Отличаются имена типов %1 и %2";
		Текст = СтрШаблон(Текст, Тип_1.Имя, Тип_2.Имя);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		ЕстьОтличия = Истина;
	КонецЕсли;	           
	
	Сч = 0;
	Если НЕ Тип_1.Свойства.Количество() = Тип_2.Свойства.Количество() Тогда
		Текст = "Разное кол-во свойств в типе %1";
		Текст = СтрШаблон(Текст, Тип_1.Имя);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		ЕстьОтличия = Истина;             
	Иначе
		Для Каждого Свойство_1 Из Тип_1.Свойства Цикл
			СравнитьСвойства(Свойство_1, Тип_2.Свойства[Сч], ЕстьОтличия);
			Сч = Сч + 1;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура СравнитьСвойства(Свойство_1, Свойство_2, ЕстьОтличия)

	Если НЕ Свойство_1.Имя = Свойство_2.Имя Тогда
		Текст = "Отличаются имена свойств %1 и %2";
		Текст = СтрШаблон(Текст, Свойство_1.Имя, Свойство_2.Имя);
		ОбщегоНазначения.СообщитьПользователю(Текст);
		ЕстьОтличия = Истина;
	КонецЕсли;	           
	
КонецПроцедуры