#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ХранилищеЗначения = Новый ХранилищеЗначения(ТекущийОбъект.Сообщение);
	Если Не ЗначениеЗаполнено(ТекущийОбъект.IDСообщения) Тогда
		ТекущийОбъект.IDСообщения = Новый УникальныйИдентификатор;
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДокументНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПерейтиПоНавигационнойСсылке(Запись.НавигационнаяСсылка);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	// месяц нужен для поледующей очистки сообщений за месяц
	Запись.Месяц = НачалоМесяца(Запись.Дата);
КонецПроцедуры

#КонецОбласти

