#Область ОбработчикиСобытийФормы

&НаСервере
Процедура дкл_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая()	Тогда
		Возврат;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	дкл_СкладскиеЯчейки.poseX КАК poseX,
		|	дкл_СкладскиеЯчейки.poseY КАК poseY,
		|	дкл_СкладскиеЯчейки.width КАК width,
		|	дкл_СкладскиеЯчейки.depth КАК depth,
		|	дкл_СкладскиеЯчейки.barcode КАК barcode,
		|	дкл_СкладскиеЯчейки.trayNumber КАК trayNumber
		|ИЗ
		|	РегистрСведений.дкл_СкладскиеЯчейки КАК дкл_СкладскиеЯчейки
		|ГДЕ
		|	дкл_СкладскиеЯчейки.СкладскаяЯчейка = &СкладскаяЯчейка";
	
	Запрос.УстановитьПараметр("СкладскаяЯчейка", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	НовыйЭлемент = Элементы.Вставить("ГруппаКоординатыРасположенияВАСХ",
		Тип("ГруппаФормы"),Неопределено,Неопределено);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Заголовок = "Координаты расположения в АСХ";
	НовыйЭлемент.Подсказка = "Группа координаты расположения в АСХ ДиКоМ";

	НовыйЭлемент = Элементы.Вставить("poseX",Тип("ДекорацияФормы"),
		Элементы.ГруппаКоординатыРасположенияВАСХ,Неопределено);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок = 
		"Точка нахождения по оси X: " + ?(ЗначениеЗаполнено(Выборка.poseX), Выборка.poseX, "-");

	НовыйЭлемент = Элементы.Вставить("poseY",Тип("ДекорацияФормы"),
		Элементы.ГруппаКоординатыРасположенияВАСХ,Неопределено);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок = 
		"Точка нахождения по оси Y: " + ?(ЗначениеЗаполнено(Выборка.poseY), Выборка.poseY, "-");
	
	НовыйЭлемент = Элементы.Вставить("width",Тип("ДекорацияФормы"),
		Элементы.ГруппаКоординатыРасположенияВАСХ,Неопределено);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок = 
		"Ширина: " + ?(ЗначениеЗаполнено(Выборка.width), Выборка.width, "-");

	НовыйЭлемент = Элементы.Вставить("depth",Тип("ДекорацияФормы"),
		Элементы.ГруппаКоординатыРасположенияВАСХ,Неопределено);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок = 
		"Глубина: " + ?(ЗначениеЗаполнено(Выборка.depth), Выборка.depth, "-");

КонецПроцедуры                     

#КонецОбласти