#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Результат = Справочники.дкл_НастройкиСкладовЛифтов.ПолучитьРеквизитыSKU(
		ТекущийОбъект.Номенклатура, ТекущийОбъект.Характеристика, ТекущийОбъект.Упаковка);
		
	Если ЗначениеЗаполнено(ТекущийОбъект.ItemID) Тогда     
		// оставляем ItemID каким был...
		ЗаполнитьЗначенияСвойств(ТекущийОбъект, Результат, ,"ItemID");
	Иначе 
		// присваиваем ItemID
		ЗаполнитьЗначенияСвойств(ТекущийОбъект, Результат);		
	КонецЕсли;		
	
	ТекущийОбъект.Статус = Перечисления.дкл_Статусы.Изменено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзменениеНоменклатурыСкладаЛифта");
КонецПроцедуры

#КонецОбласти

