#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс   

//@skip-check export-procedure-missing-comment
//@skip-check doc-comment-parameter-section
//@skip-check doc-comment-export-function-return-section
Функция ПолучитьТекстЗапросаНоменклатурыСклада(ПоместитьВоВременнуюТаблицу = Ложь) Экспорт
	
	Текст =
	"ВЫБРАТЬ
	|	НоменклатураСклада.Номенклатура КАК Номенклатура,
	|	НоменклатураСклада.Характеристика КАК Характеристика,
	|	НоменклатураСклада.Упаковка КАК Упаковка,              
	// наименование собираем как Н + Х + У:
	|	ВЫБОР
	|		КОГДА НЕ НоменклатураСклада.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				И НЕ НоменклатураСклада.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА НоменклатураСклада.Номенклатура.Наименование + "", "" + НоменклатураСклада.Характеристика.Наименование + "", "" + НоменклатураСклада.Упаковка.Наименование
	|		КОГДА НЕ НоменклатураСклада.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				И НоменклатураСклада.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА НоменклатураСклада.Номенклатура.Наименование + "", "" + НоменклатураСклада.Характеристика.Наименование
	|		КОГДА НоменклатураСклада.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				И НЕ НоменклатураСклада.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА НоменклатураСклада.Номенклатура.Наименование + "", , "" + НоменклатураСклада.Упаковка.Наименование
	|		ИНАЧЕ НоменклатураСклада.Номенклатура.Наименование
	|	КОНЕЦ КАК itemName,
	|	НоменклатураСклада.extraCode КАК extraCode,
	|	НоменклатураСклада.itemId КАК itemId,
	|	НоменклатураСклада.unit КАК unit,
	|	НоменклатураСклада.vendorNumber КАК vendorNumber,
	|	НоменклатураСклада.height КАК height,
	|	НоменклатураСклада.width КАК width,
	|	НоменклатураСклада.depth КАК depth,
	|	НоменклатураСклада.weight КАК weight,
	|	НоменклатураСклада.barcode КАК barcode,
	|	НоменклатураСклада.Активна КАК Активна,
	|	НоменклатураСклада.СопоставленоВручную КАК СопоставленоВручную
	|ИЗ
	|	РегистрСведений.дкл_НоменклатураСкладов КАК НоменклатураСклада
	|ГДЕ
	|	НоменклатураСклада.НастройкаСклада = &НастройкаСклада";                                                       
	
	Если ПоместитьВоВременнуюТаблицу Тогда
		Текст = СтрЗаменить(Текст, "ИЗ", "ПОМЕСТИТЬ врНоменклатураСклада" + Символы.ПС + "ИЗ");		
		Текст = Текст + Символы.ПС + "ИНДЕКСИРОВАТЬ ПО	НоменклатураСклада.Номенклатура, НоменклатураСклада.Характеристика";
	КонецЕсли;

	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
